Repository: rudrankriyam/Foundation-Models-Framework-Lab
Catalog: Foundation Lab/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans, zh_hant

source: Show my next calendar event and identify how much free time I have before it.
de: Zeigen Sie meine nächste Kalenderveranstaltung und identifizieren Sie, wie viel Freizeit ich davor habe.
es: Mostrar mi próximo evento calendario e identificar cuánto tiempo libre tengo antes.
fr: Montrez mon prochain événement de calendrier et identifiez combien de temps libre j'ai avant lui.
it: Mostra il mio prossimo evento di calendario e identificare quanto tempo libero ho prima di esso.
ja: 次回のカレンダーイベントを表示し、その前にどれだけの空き時間であるかを識別します。
ko: 다음 캘린더 이벤트를 표시하고 몇 가지 무료 시간을 식별합니다.
pt_br: Mostre meu próximo evento e identifique quanto tempo livre tenho antes.
zh_hans: 显示我的下一个日历事件, 并确定我有多少空闲时间摆在它面前 。
zh_hant: 顯示我的下一個行事曆活動, 並指出我有多少空闲時間。

source: Show reminders due today and suggest which one I should tackle first.
de: Zeigen sie erinnerungen, die heute fällig sind, und schlagen sie vor, welche ich zuerst angehen sollte.
es: Mostrar recordatorios de hoy y sugerir cuál debería abordar primero.
fr: Montrez les rappels dus aujourd'hui et suggérez lequel je devrais aborder en premier.
it: Mostra i promemoria dovuti oggi e suggerisci quale devo affrontare prima.
ja: 今日はリマインダーを表示し、最初に取り組むべきものを提案します。
ko: 오늘 때문에 알림 표시하고 내가 먼저 촉발해야한다는 것을 건의하십시오.
pt_br: Mostre lembranças para hoje e sugira qual devo enfrentar primeiro.
zh_hans: 显示今天到期的提醒,并建议我先处理哪个。
zh_hant: 顯示今天到期的提醒, 建議我先處理哪一個 。

source: Shows
de: Anzeige
es: Visualización
fr: Affiche
it: Eventi
ja: ショー
ko: 표시
pt_br: Visualização
zh_hans: 显示
zh_hant: 顯示

source: Shows the model's reasoning trace
de: Zeigt die Argumentationsspur des Modells
es: Muestra el rastro de razonamiento del modelo
fr: Affiche la trace du raisonnement du modèle
it: Mostra la traccia di ragionamento del modello
ja: モデルの推論トレースを表示する
ko: 모형의 reasoning trace를 보여주십시오
pt_br: Mostra o raciocínio do modelo.
zh_hans: 显示模型的推理线索
zh_hant: 顯示模型的推理追蹤

source: Signed
de: Unterzeichnet
es: Firmado
fr: Signé
it: Firmato
ja: サインイン
ko: 서명됨
pt_br: Assinado.
zh_hans: 已签署
zh_hant: 已簽署

source: Signed FMFBenchDeviceRunner
de: Unterzeichnet FMFBenchDeviceRunner
es: FMFBenchDeviceRunner firmado
fr: Signé FMFBenchDeviceRunner
it: Firmato FMFBenchDeviceRunner
ja: サインイン FMFBenchDeviceRunner
ko: 서명된 FMFBenchDeviceRunner
pt_br: Assinado. FMFBenchDeviceRunner
zh_hans: 已签署 FMFBenchDeviceRunner
zh_hant: 已簽署 FMFBenchDeviceRunner

source: Size
de: Größe
es: Tamaño
fr: Taille
it: Dimensione
ja: サイズ:
ko: 크기
pt_br: Tamanho
zh_hans: 大小
zh_hant: 大小

source: Sleep
de: Schlaf
es: Sueño
fr: Sommeil
it: Sonno
ja: 睡眠
ko: 수면
pt_br: Sono
zh_hans: 睡眠
zh_hant: 睡眠

source: Source
de: Quelle
es: Fuente
it: Fonte
ja: ソース
ko: 출처
pt_br: Fonte
zh_hans: 来源
zh_hant: 來源

source: Sources
de: Quellen
es: Fuentes
it: Fonti
ja: ソース
ko: 출처
pt_br: Fontes
zh_hans: 资料来源
zh_hant: 來源

source: Speech recognition is not available on this device.
de: Die Spracherkennung ist auf diesem Gerät nicht verfügbar.
es: El reconocimiento de voz no está disponible en este dispositivo.
fr: La reconnaissance vocale n'est pas disponible sur cet appareil.
it: Il riconoscimento vocale non è disponibile su questo dispositivo.
ja: 音声認識は、このデバイスでは利用できません。
ko: 음성 인식은이 장치에서 사용할 수 없습니다.
pt_br: Reconhecimento de fala não está disponível neste dispositivo.
zh_hans: 此设备中没有语音识别 。
zh_hant: 此裝置沒有聲效認證 。

source: Stage
de: Phase
es: Etapa
fr: Étape
it: Fase
ja: ステージ
ko: 단계
pt_br: Estágio
zh_hans: 阶段
zh_hant: 舞台

source: Start with
de: Beginnen Sie mit
es: Empieza con
fr: Commencez par
it: Inizia con
ja: まずは
ko: 시작하기
pt_br: Comece com
zh_hans: 开始
zh_hant: 從

source: Steps
de: Schritte
es: Pasos
fr: Pas
it: Passi
ja: 歩数
ko: 걸음 수
pt_br: Passos
zh_hans: 步数
zh_hant: 步數

source: Suites
de: Suiten
es: Suite
fr: Suite
it: Suite
ja: スイート
ko: 테스트 모음
zh_hans: 诉讼
zh_hant: 測試套件

source: Summarize
de: Summarisieren
es: Resumen
fr: Résumé
it: Sintesi esecutiva
ja: サマライズ
ko: 요약
pt_br: Resumir
zh_hans: 总结
zh_hant: 摘要

source: Summarize earlier turns
de: Zusammenfassung früherer Umdrehungen
es: Summarize giros anteriores
fr: Résumez les tours précédents
it: Summarize giri precedenti
ja: 以前の回転を要約
ko: 이전 회전을 요약
pt_br: Resuma as voltas anteriores.
zh_hans: 总结早先的转弯
zh_hant: 概述先前的轉折

source: Summarize my steps, active energy, and walking distance for today using only available Health data.
de: Fassen Sie meine Schritte, aktive Energie und Gehdistanz für heute mit nur verfügbaren Gesundheitsdaten zusammen.
es: Resumir mis pasos, energía activa y distancia a pie para hoy utilizando sólo datos de salud disponibles.
fr: Résumez mes pas, l'énergie active et la distance de marche pour aujourd'hui en utilisant uniquement les données disponibles sur la santé.
it: Riassumere i miei passi, l'energia attiva e la distanza a piedi per oggi utilizzando solo i dati di salute disponibili.
ja: 利用可能な健康データのみを使用して、今日の手順、アクティブなエネルギー、および歩行距離を損なう。
ko: 해당 이용 후기에 달린 코멘트가 없습니다.
pt_br: Resumir meus passos, energia ativa e distância para hoje usando apenas dados de saúde disponíveis.
zh_hans: 总结我今天的台阶、积极能量和行走距离, 只使用现有的健康数据。
zh_hant: 總結我今天的台階、活性能量和行走距离,

source: Summarize the main points of this document.
de: Fassen Sie die Hauptpunkte dieses Dokuments zusammen.
es: Resumir los principales puntos de este documento.
fr: Résumez les principaux points de ce document.
it: Riassumere i punti principali di questo documento.
ja: このドキュメントの主なポイントを損なう。
ko: 이 문서의 주요 점을 요약합니다.
pt_br: Resumir os principais pontos deste documento.
zh_hans: 总结本文件要点.
zh_hant: 概述本文件的要点。

source: Summarize the reflection without diagnosing. Then offer one gentle follow-up question.
de: Fassen Sie die Reflexion ohne Diagnose zusammen. Dann bieten Sie eine sanfte Folgefrage an.
es: Resumir la reflexión sin diagnosticar. Entonces ofrezca una suave pregunta de seguimiento.
fr: Résumez la réflexion sans diagnostiquer. Puis offrez une question de suivi douce.
it: Summarizzare la riflessione senza diagnosticare. Allora offri una domanda di follow-up gentile.
ja: 診断なしで反射を損なう。 それから1つの穏やかなフォローアップの質問を提供します。
ko: diagnosing 없이 반사를 요약하십시오. 그런 다음 한 가지 부드러운 후속 질문을 제공합니다.
pt_br: Resumir o reflexo sem diagnosticar. Então ofereça uma pergunta gentil.
zh_hans: 总结反射而不诊断. 然后提出一个温柔的后续问题。
zh_hant: 總結反射而不分析 那就提出一個溫柔的問題

source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
it: Sintesi
ja: 要約
ko: 요약
pt_br: Resumo
zh_hans: 摘要
zh_hant: 摘要

source: Summary of earlier conversation
de: Zusammenfassung früherer Gespräche
es: Resumen de la conversación anterior
fr: Résumé de la conversation précédente
it: Sintesi della conversazione precedente
ja: 以前の会話の要約
ko: 이전 대화의 개요
pt_br: Resumo da conversa anterior
zh_hans: 先前谈话摘要
zh_hant: 之前的談話摘要

source: Supported Languages
de: Unterstützte Sprachen
es: Idiomas compatibles
fr: Langues soutenues
it: Lingue supportate
ja: 対応言語
ko: 지원되는 언어
pt_br: Línguas Suportadas
zh_hans: 支持的语言
zh_hant: 支援的語言

source: Sustained generation
de: Nachhaltige Generation
es: Generación sostenida
fr: Génération durable
it: Generazione garantita
ja: 持続的な世代
ko: 지속 생성
pt_br: Geração mantida
zh_hans: 可持续发电
zh_hant: 持续生成

source: Synthetic Performance
de: Synthetische Leistung
es: Desempeño sintético
fr: Performance synthétique
it: Prestazioni sintetiche
ja: 総合的な性能
ko: 합성 성과
pt_br: Desempenho Sintético
zh_hans: 合成性能
zh_hant: 合成性能

source: Synthetic samples
de: Synthetische Proben
es: Muestras sintéticas
fr: Échantillons synthétiques
it: Campioni sintetici
ja: 合成サンプル
ko: 합성 표본
pt_br: Amostras sintéticas
zh_hans: 合成样品
zh_hant: 合成樣本

source: System Model
de: Systemmodell
es: Modelo de sistema
fr: Modèle de système
it: Modello di sistema
ja: システムモデル
ko: 시스템 모델
pt_br: Modelo de Sistema
zh_hans: 系统模型
zh_hant: 系統模型

source: System instructions
de: Systemanweisungen
es: Instrucciones del sistema
fr: Instructions du système
it: Istruzioni di sistema
ja: システム指示
ko: 시스템 지침
pt_br: Instruções do sistema.
zh_hans: 系统指令
zh_hant: 系統指令

source: System language model
de: Systemsprachenmodell
es: Modelo de lenguaje de sistema
fr: Modèle de langage système
it: Modello di linguaggio di sistema
ja: システム言語モデル
ko: 시스템 언어 모델
pt_br: Modelo de linguagem do sistema.
zh_hans: 系统语言模型
zh_hant: 系統語言模型

source: System model
de: Systemmodell
es: Modelo de sistema
fr: Modèle de système
it: Modello di sistema
ja: システムモデル
ko: 시스템 모델
pt_br: Modelo de sistema.
zh_hans: 系统模型
zh_hant: 系統模型

source: System not ready
de: System nicht bereit
es: Sistema no listo
fr: Système non prêt
it: Sistema non pronto
ja: システムの準備ができていません
ko: 시스템이 준비되지 않음
pt_br: Sistema não está pronto
zh_hans: 系统未就绪
zh_hant: 系統尚未就緒

source: TTFT, decode duration, and end-to-end duration.
de: TTFTDekodierungsdauer und End-to-End-Dauer.
es: TTFT, duración de decodificación y duración de extremo a extremo.
fr: TTFT, durée de décodage et durée de bout en bout.
it: TTFT, durata di decodifica e durata end-to-end.
ja: TTFT、デコードの長さおよびエンドツーエンドの持続期間。
ko: TTFT, 데코딩 기간 및 종료 기간.
pt_br: TTFT, decodificar duração, e duração de ponta a ponta.
zh_hans: TTFT,解码持续时间,以及端对端持续时间。
zh_hant: TTFT,解碼期限,以及端到端期限。

source: Terminal on macOS 27
de: Terminal am macOS 27
es: Terminal en macOS 27
fr: Terminal macOS 27
it: Terminale su macOS 27
ja: ターミナル macOS 27 日
ko: macOS 27의 터미널
pt_br: Terminal ligado. macOS 27
zh_hans: 终端在 macOS 27个
zh_hant: 终端於 macOS 27

source: Test inputs
de: Prüfeingänge
es: Entradas de prueba
fr: Entrées d ' essai
it: Ingressi di prova
ja: テスト入力
ko: 테스트 입력
pt_br: Teste de entradas.
zh_hans: 测试输入
zh_hant: 測試輸入

source: The Evaluations framework records per-sample measurements and aggregate results in the test report.
de: Das Evaluations Framework zeichnet die Messungen pro Stichprobe und die aggregierten Ergebnisse im Prüfbericht auf.
es: El marco de Evaluaciones registra mediciones por muestreo y resultados agregados en el informe de prueba.
fr: Le cadre des évaluations enregistre les mesures par échantillon et les résultats agrégés dans le rapport d'essai.
it: Il framework Valutazioni registra misurazioni per campione e risultati aggregati nella relazione di test.
ja: 評価フレームワークは、テストレポートの1サンプル測定と集計結果を記録します。
ko: 평가 프레임 워크는 테스트 보고서의 per-sample 측정 및 집계 결과를 기록합니다.
pt_br: O quadro de avaliações registra as medições por amostra e os resultados agregados no relatório de teste.
zh_hans: 评价框架在测试报告中记录了每个样本的测量和综合结果。
zh_hant: 校對:Soup

source: The Foundation Models SDK for Python exposes the on-device model to Python 3.10+ on Apple silicon Macs with Xcode installed.
de: Die Foundation Models SDK for Python Das On-Device-Modell wird Python 3.10+ auf Apple Silicon Macs mit installiertem Xcode.
es: El Foundation Models SDK for Python expone el modelo en dispositivo para Python 3.10+ en Apple silicon Macs con Xcode instalado.
fr: Les Foundation Models SDK for Python expose le modèle sur l'appareil à Python 3.10+ sur les Mac en silicium Apple avec Xcode installé.
it: The Foundation Models SDK for Python espone il modello on-device a Python 3.10+ su Mac di silicio Apple con Xcode installato.
ja: ザ・オブ・ザ・ Foundation Models SDK for Python オンデバイスモデルを調べる Python インストールされているXcodeとAppleのシリコンMac上の3.10 +。
ko: 더 보기 Foundation Models SDK for Python on-device 모델에 노출 Python 3.10+ 에 애플 실리콘 맥 와 Xcode 설치.
pt_br: O Foundation Models SDK for Python expõe o modelo no dispositivo para Python 3,10+ em Macs de silicone Apple com Xcode instalado.
zh_hans: 那个 Foundation Models SDK for Python 打开设备模型 Python 3.10+ 在安装了Xcode的苹果硅Macs上.
zh_hant: 其 Foundation Models SDK for Python 曝光端端的模型 Python 3.10+ 在安裝了Xcode的蘋果硅Macs上.

source: The Gemini model name is invalid: %@.
de: Die Gemini Modellname ist ungültig: %@.
es: El Gemini el nombre del modelo es inválido: %@.
fr: Les Gemini le nom de modèle est invalide: %@.
it: The Gemini il nome del modello non è valido: %@.
ja: ザ・オブ・ザ・ Gemini モデル名は無効です。 %@お問い合わせ
ko: 더 보기 Gemini 모델명은 유효하지 않습니다: %@·
pt_br: O Gemini O nome do modelo é inválido. %@.
zh_hans: 那个 Gemini 模型名称无效 : %@。 。 。 。
zh_hant: 其 Gemini 模型名稱不合法 : %@.

source: The adapter directory is unavailable.
de: Das Adapterverzeichnis ist nicht verfügbar.
es: El directorio de adaptador no está disponible.
fr: Le répertoire de l'adaptateur n'est pas disponible.
it: La directory adattatore non è disponibile.
ja: アダプターディレクトリは利用できません。
ko: 어댑터 디렉토리는 사용할 수 없습니다.
pt_br: O diretório do adaptador não está disponível.
zh_hans: 适配器目录不可用 。
zh_hant: 适配器目錄不可用 。

source: The app sends a %lld-character user request as prompt content.
de: Die App sendet eine %lld-Zeichenbenutzeranforderung als prompter Inhalt.
es: La aplicación envía un %lld- solicitud de usuario de caracteres como contenido rápido.
fr: L'application envoie une %lld-la requête de l'utilisateur de caractères comme contenu rapide.
it: L'app invia una %lld-character richiesta utente come contenuto rapido.
ja: アプリが送信する %lld-character のユーザ要求はプロンプトの内容として要求します。
ko: 앱은 %lld-character 사용자 요청은 신속한 내용입니다.
pt_br: O aplicativo envia um %lld- Pedido de usuário como conteúdo imediato.
zh_hans: 应用程序发送一个 %lld- 特征用户请求作为快速内容。
zh_hant: 應用程式發送 %lld- 特征用戶要求為即時內容 。

source: The app stopped the proposed action before any side effect.
de: Die App stoppte die vorgeschlagene Aktion vor jeder Nebenwirkung.
es: La aplicación detuvo la acción propuesta antes de cualquier efecto secundario.
fr: L'application a arrêté l'action proposée avant tout effet secondaire.
it: L'applicazione ha fermato l'azione proposta prima di qualsiasi effetto collaterale.
ja: アプリは、任意の副作用の前に提案されたアクションを停止しました。
ko: 앱은 어떤 부작용 전에 제안 된 작업을 중단했습니다.
pt_br: O aplicativo parou a ação proposta antes de qualquer efeito colateral.
zh_hans: 该应用程序在任何副作用前就停止了拟议行动.
zh_hant: 在任何副作用之前,

source: The demo recorded approval but intentionally has no message transport, so nothing was sent.
de: Die Demo hat die Genehmigung aufgezeichnet, aber absichtlich keinen Nachrichtentransport, so dass nichts gesendet wurde.
es: La demo registró aprobación pero intencionalmente no tiene transporte de mensajes, así que nada fue enviado.
fr: La démo a enregistré l'approbation mais intentionnellement n'a pas de transport de message, donc rien n'a été envoyé.
it: La demo ha registrato l'approvazione, ma intenzionalmente non ha il trasporto di messaggi, quindi nulla è stato inviato.
ja: デモは承認を録音したが、意図的にメッセージの輸送がないので、何も送信されませんでした。
ko: 데모는 승인하지만 의도적으로 메시지 전송이 없습니다, 그래서 아무것도 전송되지 않았다.
pt_br: A demo registrou aprovação, mas intencionalmente não tem transporte de mensagens, então nada foi enviado.
zh_hans: 演示记录了批准情况,但故意没有信息传输,因此没有发送任何信息。
zh_hant: 但故意沒有訊息傳送,

source: The executor receives the session transcript and is responsible for mapping its entries to the provider's request format.
de: Der Ausführende erhält das Sitzungsprotokoll und ist dafür verantwortlich, seine Einträge dem Anforderungsformat des Anbieters zuzuordnen.
es: El ejecutor recibe la transcripción de sesión y es responsable de mapear sus entradas al formato de solicitud del proveedor.
fr: L'exécuteur-exécuteur reçoit la transcription de la session et est responsable de la cartographie de ses entrées au format de demande du fournisseur.
it: L'esecutore riceve la trascrizione di sessione ed è responsabile della mappatura delle sue voci al formato di richiesta del fornitore.
ja: executor はセッションのトランスクリプトを受信し、そのエントリをプロバイダのリクエスト形式にマッピングする責任を負います。
ko: executor는 session transcript를 수신하고 공급자의 요청 형식으로 항목을 매핑하는 책임입니다.
pt_br: O executor recebe a transcrição da sessão e é responsável por mapear suas entradas no formato de solicitação do provedor.
zh_hans: 执行人收到会话笔录,并负责将其条目映射到提供者的请求格式.
zh_hant: 執行者接收會議的筆錄, 并负责将其項目映射到提供者的要求格式 。

source: The executor sends incremental generation events through LanguageModelExecutorGenerationChannel. The channel finishes when respond returns or throws.
de: Der Executor sendet inkrementelle Generationsereignisse durch LanguageModelExecutorGenerationChannelDer Kanal endet, wenn die Antwort zurückkehrt oder wirft.
es: El ejecutor envía eventos de generación incremental a través de LanguageModelExecutorGenerationChannel. El canal termina cuando responde devuelve o lanza.
fr: L'exécuteur envoie des événements de génération progressive à travers LanguageModelExecutorGenerationChannel. Le canal se termine lorsque la réponse revient ou lance.
it: L'esecutore invia eventi di generazione incrementale attraverso LanguageModelExecutorGenerationChannel. Il canale termina quando risponde restituisce o lancia.
ja: エクセプターは、増分生成イベントを通し、 LanguageModelExecutorGenerationChannel. 戻りや投げる時にチャンネルが終了する。
ko: executor는 incremental 생성 이벤트를 통해 보냅니다. LanguageModelExecutorGenerationChannel. 응답 반환 또는 던지기 때 수로 끝.
pt_br: O executor envia eventos de geração incremental através LanguageModelExecutorGenerationChannelO canal termina quando responder retorna ou atira.
zh_hans: 执行者通过 LanguageModelExecutorGenerationChannel。在回复返回或丢弃时,频道会结束。
zh_hant: 執行器傳送增量產生事件 LanguageModelExecutorGenerationChannel。回應回應或丟棄時, 頻道完成 。

source: The fm command ships with macOS 27. Use fm chat for interactive exploration and fm respond when a script needs a single response.
de: Das fm-Kommando schifft mit macOS 27. Verwenden Sie fm-Chat für interaktive Erkundung und fm antworten, wenn ein Skript eine einzige Antwort benötigt.
es: Las naves de comando fm con macOS 27. Use fm chat para la exploración interactiva y fm responder cuando un script necesita una sola respuesta.
fr: Le commandement fm avec macOS 27. Utilisez fm chat pour l'exploration interactive et fm répond quand un script a besoin d'une seule réponse.
it: Il comando fm navi con macOS 27. Utilizzare fm chat per l'esplorazione interattiva e fm rispondere quando uno script ha bisogno di una singola risposta.
ja: fm コマンドは、 macOS 27. スクリプトが単一の応答を必要とするとき、fm のチャットを使用してインタラクティブな探索と fm が応答します。
ko: fm 명령은 macOS 27. 대화 형 탐험 및 fm에 대한 fm 채팅을 사용하여 스크립트가 단일 응답을 필요로 할 때 응답합니다.
pt_br: As naves de comando com macOS Use o chat para exploração interativa e responda quando um roteiro precisa de uma resposta.
zh_hans: Fm指挥舰 macOS 27. 使用fm聊天进行交互探索,当一个脚本需要单个响应时fm响应.
zh_hant: fm 指令船 macOS 27. 在文稿需要單一回應時使用 fm 聊天來互動探索與 fm 回應 。

source: The framework calls the executor's prewarm hook when a session is prewarmed. Providers can load assets or prepare cached state before generation begins.
de: Das Framework ruft den Vorwarmhaken des Executors auf, wenn eine Sitzung vorgewärmt ist. Anbieter können Assets laden oder den zwischengespeicherten Zustand vorbereiten, bevor die Generation beginnt.
es: El marco llama al gancho de precalentamiento del ejecutor cuando una sesión está precalentada. Los proveedores pueden cargar activos o preparar estado de caché antes de que comience la generación.
fr: Le cadre appelle l'hameçon de l'exécuteur lorsqu'une session est préchauffée. Les fournisseurs peuvent charger des actifs ou préparer l'état cache avant le début de la génération.
it: Il framework chiama l'amo pre-bellico dell'esecutore quando una sessione è pre-riscaldata. I fornitori possono caricare le attività o preparare lo stato cache prima dell'inizio della generazione.
ja: フレームワークは、セッションが予報されると、予報者の予報を呼び出します。 プロバイダーは、生成前にアセットをロードしたり、キャッシュされた状態を準備したりすることができます。
ko: 프레임 워크는 세션이 prewarmed 할 때 executor의 prewarm Hook을 호출합니다. 공급자는 자산을로드하거나 생성 전에 캐시 된 상태를 준비 할 수 있습니다.
pt_br: A estrutura chama o gancho pré-aquecido do executor quando uma sessão é pré-aquecida. Os fornecedores podem carregar ativos ou preparar o estado antes da geração começar.
zh_hans: 框架称执行器在会话被预置时的预置钩. 供应商可以在生成开始前加载资产或准备缓存状态.
zh_hant: 框架稱為執行器在會議預裝時的溫室前钩子 。 提供商可以在產生前載入資產或準備缓存狀態 。

source: The label is metadata from your app, not a framework-provided trust classification.
de: Bei dem Label handelt es sich um Metadaten aus Ihrer App, nicht um eine vom Rahmen bereitgestellte Vertrauensklassifizierung.
es: La etiqueta es metadatos de su aplicación, no una clasificación de confianza proporcionada por marco.
fr: L'étiquette est des métadonnées de votre application, pas une classification de confiance fournie par le cadre.
it: L'etichetta è metadati dalla tua app, non una classificazione di fiducia basata sul framework.
ja: ラベルは、フレームワークによって証明される信頼の分類ではなく、アプリからメタデータです。
ko: 라벨은 앱에서 메타데이터이며, 프레임 워크 보호된 신뢰 분류가 아닙니다.
pt_br: A etiqueta é metadados do seu aplicativo, não uma classificação de confiança fornecida pelo framework.
zh_hans: 标签是您应用程序的元数据, 不是框架提供的信任分类 。
zh_hant: 標籤是您的應用程式的中繼資料, 不是框架提供的信任分類 。

source: The measured flips align with a 4-byte BGRA decode buffer, using a 16-byte-aligned row stride, crossing 2^31 bytes. This is an implementation inference, not an official Apple limit.
de: Die gemessenen Flips stimmen mit einem 4-Byte überein BGRA Decodierungspuffer unter Verwendung eines 16-Byte-ausgerichteten Zeilenschritts, der 2^31 Bytes kreuzt. Dies ist ein Implementierungsschluss, kein offizielles Apple-Limit.
es: Las vueltas medida se alinean con un 4 bytes BGRA búfer decodificador, con un paso de fila alineado de 16 bytes, cruzando 2^31 bytes. Esta es una inferencia de implementación, no un límite oficial de Apple.
fr: Les retournements mesurés s'alignent sur un 4-octets BGRA déchiffrer le tampon à l'aide d'une strate de ligne alignée à 16 octets, traversant 2^31 octets. C'est une inférence d'implémentation, pas une limite officielle d'Apple.
it: Le lancette misurate si allineano con un 4-byte BGRA decodificare il buffer, utilizzando un 16 byte-allineed file stride, attraversando 2^31 byte. Questa è un'inferenza di implementazione, non un limite ufficiale di Apple.
ja: 測定されたフリップは4バイトと整列します BGRA バッファをデコードし、16バイト整列された行ストライドを使用して、2^31バイトを交差させます。 これは、公式のApple制限ではなく、実装の推論です。
ko: 측정된 플립은 4 바이트로 정렬됩니다. BGRA 16 바이트 정렬 행 stride를 사용하여 디코드 버퍼, 2^31 바이트를 교차. 이것은 공식 Apple 제한이 아닙니다.
pt_br: Os giros medidos se alinham com um 4-byte. BGRA Decodificar buffer, usando uma passada de 16 bytes, cruzando 2^31 bytes. Isto é uma inferência de implementação, não um limite oficial da Apple.
zh_hans: 测量的翻转符合 4 字节 BGRA 解码缓冲器,使用16字节对齐的行步,跨越2^31字节. 这是一个执行推论,而不是苹果的官方限制.
zh_hant: 計算的翻轉符合 4 字節 BGRA 解碼缓冲区, 使用 16 字节的行步, 跨越 2^31 字節 。 這是一個執行推測,不是Apple的正式限制。

source: The model can generate arguments and Foundation Models can invoke the registered Tool.call method.
de: Das Modell kann Argumente erzeugen und Foundation Models kann sich auf die registrierte Tool.call Methode.
es: El modelo puede generar argumentos y Foundation Models puede invocar el registro Tool.call método.
fr: Le modèle peut générer des arguments et Foundation Models peut invoquer l'enregistrement Tool.call méthode.
it: Il modello può generare argomenti e Foundation Models può invocare il registrato Tool.call metodo.
ja: モデルは引数を生成し、 Foundation Models 登録を呼び出すことができます Tool.call メソッド。
ko: 모델은 인수를 생성하고 Foundation Models 등록 할 수 있습니다 Tool.call 방법.
pt_br: O modelo pode gerar argumentos e Foundation Models Pode invocar o registrado. Tool.call Método.
zh_hans: 该模型可生成参数和 Foundation Models 可以引用已注册 Tool.call 方法。
zh_hant: 模型可以產生參數 Foundation Models 可以引用已註冊 Tool.call 方法。

source: The model may propose a message; app code owns validation and authorization.
de: Das Modell kann eine Nachricht vorschlagen; App-Code besitzt Validierung und Autorisierung.
es: El modelo puede proponer un mensaje; código de aplicación posee validación y autorización.
fr: Le modèle peut proposer un message; le code app possède la validation et l'autorisation.
it: Il modello può proporre un messaggio; il codice app possiede la validazione e l'autorizzazione.
ja: モデルは、メッセージを提案することができます。アプリコードは検証と認可を所有しています。
ko: 모델은 메시지를 전파 할 수 있습니다. 앱 코드는 유효성 및 허가를 소유합니다.
pt_br: O modelo pode propor uma mensagem, código do aplicativo possui validação e autorização.
zh_hans: 该模型可能提出一个消息;应用代码拥有验证和授权.
zh_hant: 模式可能會提出訊息;應用程式代碼擁有驗證和授權.
